# Pandas Notebook Rough

##### Developed in 2008 by Wes Meckeney, while working in a private company

### UseCases

- Data cleaning
- Data analysis
- Data transformation
- Data Visualization (Basic)
- Data Aggression
- File Handling
- Data filtering and selection
- Time series analysis

### Index

- Series
- DataFrames
- Missing Data
- Merging, joining, concatenating
- GroupBy and Aggregations
- Pivot Tables and crosstabs
- Operations
- Working with real data
- Some Capstone projects

In [4]:
import numpy as np
import pandas as pd

## Creating Series

##### Series are 1D arrays capable of holding any type of data. The axis labels are collectively called the index. They are in vertical format.

In [10]:
# Multiple ways to create series

labels = ['a', 'b', 'c']
myLists = [10, 20, 30]
array = np.array([30, 40, 50])
dic = {1: 25, 2: 50, 3: 44}

In [ ]:
# Simple series with labels (index): datapoints (created from list)

pd.Series(myLists) # 0, 1, 2 are labels.... and values are data points

In [ ]:
# Custom labels

pd.Series(myLists, index = labels)

In [ ]:
# Creating series from an array

pd.Series(array)

In [ ]:
# creating series from dictionary

pd.Series(dic)

# Data Frames

### Combination of multiple series ---> DataFrame

- Creating a dataframe
- Selection and indexing of columns
- Creating a new column
- Removing a  column
- Selecting rows
- Selecting subsets of rows and columns
- Conditional selections

#### Creating a DataFrame

In [5]:
i = ['MSSF001', 'MSSF002', 'MSSF003', 'MSSF004']
dataDict = {
    'Name': ['Talal', 'Ahmad', 'Faiqa', 'Ali'],
    'Age': [18, 19, 17, 21],
    'City': ['Lahore', 'Islamabad', 'Karachi', 'Peshawar'],
    'Salary': [170000, 65000, 82000, 115000]
}

# Creating a DataFrame using dictionary
df = pd.DataFrame(dataDict, index=i)
df

          Name  Age       City  Salary
MSSF001  Talal   18     Lahore  170000
MSSF002  Ahmad   19  Islamabad   65000
MSSF003  Faiqa   17    Karachi   82000
MSSF004    Ali   21   Peshawar  115000

In [6]:
i = ['MSSF001', 'MSSF002', 'MSSF003', 'MSSF004']
data = [
    ['Talal', 18, 'Lahore', 170000],
    ['Ahmad', 19, 'Islamabad', 65000],
    ['Faiqa', 17, 'Karachi', 82000],
    ['Ali', 21, 'Peshawar', 115000]
]

# Creating a DataFrame using List
Col = ['Name', 'Age' ,'City', 'Salary']
df2 = pd.DataFrame(data, index = i, columns = Col)
df2

          Name  Age       City  Salary
MSSF001  Talal   18     Lahore  170000
MSSF002  Ahmad   19  Islamabad   65000
MSSF003  Faiqa   17    Karachi   82000
MSSF004    Ali   21   Peshawar  115000

### Selecting and Indexing of columns

In [ ]:
col1 = df[['Age']]
print(col1)
col = df2[['Name', 'Salary']] 
print(col)

# Continuing